 /************************************/
 /* 建立CGRAM函数                    */
 /* 内部调用函数：PR1(),PR12(),ST3() */
 /* 函数调用入口：CGRAM()            */
 /* 连接字库：CGTAB                  */
 /************************************/
 CGRAM()
     {
        unsigned int i;
        dat1=0x03;    /* 设置CGRAM偏置地址 */
        dat2=0x00;
        com=0x22;
        PR1();
        dat1=0x00;    /* 设置RAM地址指针 */
        dat2=0x1c;
        com=0x24;
        PR1();
        com=0xb0;     /* 设置自动写方式 */
        PR12();
        for(i=0;i<64;i++)
           {
             ST3();   /* 判自动写状态位S3 */
             d_add=CCTAB[i];  /* 写入数据 */
           }
        com=0xb2;    /* 写入结束自动写指令 */
        PR12();
      }


