/************************************/
/* 清显示RAM 区(清屏)函数CLEAR      */
/* 内部调用函数：PR1(),PR12(),ST3() */
/* 函数输入变量：无                 */
/* 函数调用入口：CLEAR()            */
/************************************/
CLEAR()
    {
    unsigned char i;
        dat1=0x00;      /* 设置显示RAM 首地址 */
        dat2=0x00;
        com=0x24;
        PR1();
        com=0xb0;       /* 设置自动写方式 */
        PR12();
    for(i=0;i<8200;i++)  /* 清8K存储器 */
       {         
         ST3();   /* 判状态位S3 */
         d_add=0x00;  /* 写入数据 */            
        }
       com=0xb2;       /* 设置自动写结束指令 */
       PR12();
    }




