/*****************************/
/*  直接访问方式的驱动函数   */
/*****************************/
/* 直接驱动子程序由3个函数组成：
     1.双字节参数指令写入函数PR1
     2.单字节参数指令写入函数 PR11
     3.无参数指令写入函数 PR12
   占用系统接口资源:
      DWADD1,CWADD1
   程序输入变量：COM 或 DAT1 */

/*--判状态位S1,S0 函数(读写指令和读写数据状态)--*/

ST01()
    {
      do
        {
        ACC=cwadd1;
        }
      while(Acc_0==0,Acc_1==0);

    }
/*-------判状态位S2函数(数据自动读状态)--------*/

ST2()
   {
     do
     {
       ACC=cwadd1;
     }
    while(Acc_2==0);
   }

/*-------判状态位S3函数(数据自动写状态)-------*/
ST3()
   {
     do
     {
       ACC=cwadd1;
     }
     while(Acc_3==0);
   }

/*------无参数指令写入函数------*/

PR12()
   {
     ST01();
     cwadd1=com;
   }
/*----单字节参数指令写入函数----*/
PR11()
    {
      ST01();
      dwadd1=dat2;
      PR12();
    }
/*----双字节参数指令写入函数----*/

PR1()
    {
      ST01();
      dwadd1=dat1;
      PR11();
    }






