 /********************************/
 /* 初始化函数INT_1              */
 /* 内部调用函数：PR1(),PR12()   */
 /* 函数调用入口：INT_1()        */
 /* 函数参数:PARA1               */
 /* 函数调用变量：无             */
 /********************************/
INT_1()
    {
       dat1=0x00;      /*设文本显示区域首地址*/
       dat2=0x00;
       com=0x40;
       PR1();
       dat1=para1;    /*设文本显示区域宽度*/
       dat2=0x00;
       com=0x41;
       PR1();
       dat1=0x00;   /*设图形显示区域首地址*/
       dat2=0x08;
       com=0x42;
       PR1();
       dat1=para1;    /*设图形显示区域宽度*/
       dat2=0x00;
       com=0x43;
       PR1();
       com=0xa0;      /*光标形状设置*/
       PR12();
       com=0x80;      /*显示方式设置逻辑"或"合成*/
       PR12();
       com=0x9c;      /*显示开关设置 开文本和图形显示*/
       PR12();
    }
