/****************************/
/* 屏拷贝函数SCOPY          */
/* 内部调用函数：PR1,PR12   */
/* 函数调用入口： SCOPY()   */
/* 函数输入变量： O_X,O_Y   */
/****************************/
SCOPY()
  {
    unsigned char i;
   for(i=0;i<16;i++) /* 屏拷贝16次 */
        {
          dat1=O_X;
          dat2=O_Y;
          com=0x24;
          PR1();
          com=0xe8;    /* 写入拷贝指令 */
          PR12();      /*判屏拷贝操作状态位正确与否 */
          st6();
          O_X=O_X+0x28;  /* 修正图形区地址 */
          O_Y=O_Y;       /* 下一行首地址 */
         }
   }
