/********************************/
/* 屏读函数SREAD                */
/* 内部调用函数：PR1,PR3,PR12   */
/* 函数调用入口： SREAD()       */
/* 函数输入变量： O_X,O_Y       */
/********************************/
SREAD()
  {
    unsigned char i;
     for(i=0;i<16;i++)   /* 屏读16次 */
        {
          dat1=O_X;
          dat2=O_Y;
          com=0x24;
          PR1();
          com=0xe0;    /* 屏读指令写入 */
          PR12();
          st6();       /* 判屏读状态位正确与否 */
          PR3();       /* 读数据 */
          com=0xc4;    /* 将该数据写入该图形区单元内 */
          PR11();
          O_X=O_X+0x28;  /*修正图形区地址至下一行第一列*/
          O_Y=O_Y;
        }
    }
