/******************************/
/* 绘点函数:W_DOT             */
/* 内部调用函数：PR1(),PR12() */
/* 函数参数选择：PARA1        */
/* 函数调用入口：W_DOT        */
/* 函数输入变量：O_X，O_Y     */
/******************************/
W_DOT()
     {
        unsigned char i,j;
        unsigned int k;
             i=para1;
             j=O_X%8;
             O_X=O_X/8;
             k=i*O_Y+O_X+0x0800;  /* "0x0800"为图形区起始地址可根据客户要求自己定 */
             dat1=k%256;
             dat2=k/256;
             com=0x24;
             PR1();
             j=0x07-j;
             com=j|0xf8;
             PR12();
     }



